{
    "title": "The Foundation Signal Proposal",
    "description": "To whom it may concern,\n\nLaunched earlier this year by former Enigma Head of Growth Tor Bair, Secret Foundation is dedicated to building, researching, and scaling open-source, privacy-centric technologies for the public good. This organization is an important piece of the Secret Network ecosystem. Secret Foundation is helping to establish efficient and effective governance practices for the community and the Foundation itself. Additionally, it produces educational content and supports various committees.\n\nOur mission is to advance privacy as a public good, empowering people by providing the tools, technologies, education, and support necessary to preserve their freedom.\n\nSecret Foundation aims to set the highest possible standard for accountability and transparency while achieving sustainable growth. This will require a balance of communicative collaboration and decisive action, enabling “Secret Agents” to collectively pursue a common goal: meaningful adoption of privacy-first applications built on Secret Network.\n\nInitially, the Foundation is primarily funded by a donation from Enigma MPC; however, self-sustainability is crucial. Therefore, we are proposing to the Secret Network community that Secret Foundation will receive 15 percent of block rewards in perpetuity, in order to fund critical operations. As a neutral ground for coordinating our ecosystem, Secret Foundation is the only entity that would receive this type of network-based funding.\n\nReferences:\nhttps://forum.scrt.network/t/proposal-inflation-and-community-pool-changes/1778/4\nhttps://blog.scrt.network/introducing-secret-foundation/\n\nThis proposal also signals our need to implement a module for distributing block rewards as a “Foundation tax.” Essentially, it would be similar functionality to the community pool, but funds will go to an address configurable by a governance parameter. This address can either be a multisig or a regular address.\n\nThe following parameters would need to be tunable by the network via governance proposals:\n\nAddress to which the rewards are allocated\nPercentage taken from the total block rewards\nGlobal enabling/disabling of the module\n\nThanks for your consideration! We are very excited to aggressively expand our ecosystem and help support community contributors. Long live Secret Network 🙂",
    "type": "Text",
    "deposit": "1000000uscrt"
  }
